'''Создайте функцию greeting, которая внутри выводит приветственное сообщение print('Hello world!'). И вызовите ее.'''

def greeting():
    print('Hello world!')

greeting()
